const { add, suite, cycle, complete } = require('benny')

const data = `  第1章 梦的开始

  暴雨如瀑，电闪雷鸣，冰冷的钢铁高墙之内，第一中心医院。

  高级vip独立产房内，空气清新，环境十分优雅。

  此时一名面容俊朗，眼眸深邃有神，轮廓分明的医师站在病床边。对着躺在床上的一名年轻貌美的产妇，沉声说道。

  “妹妹，不是哥哥逼迫你，我实话跟你说吧，那个孩子全身器官萎缩，神经发育不完整，活下来的概率很低。哪怕出现奇迹，侥幸活下来，很大概率也是会落个残疾和智障。而且还不是一般的严重，可能连基本的认知都没有。”

  “真的没办法了吗？”

  眼前女子哭泣的问道。

  “哎~完全没有希望。”

  那名医师缓缓的摘掉眼镜擦了擦，无奈的叹息道。

  “我苦命的孩子。”

  眼前女子也是彻底绝望了，这无亚于判了死刑。

  “不过，正好刚才隔壁送来了一对青年夫妇，他们来医院备产的路上，出了车祸都死了。唯一庆幸的是肚中胎儿保下来了，我们只要把两个孩子互换一下就行了。之后我会把一切证据都抹除掉，至于这个孩子我会想办法收养下来，亲自抚养和照顾的。”

  “可是我舍不得他。”

  “舍不得也得舍，以他现在这个状态。如果出生在财阀家族内，很大的可能性是要被当做耻辱抹掉的。就算不被抹掉，一辈子也是在众人嘲笑中度过，更何况你现在地位不稳，如果再出现这么一摊事情，说不定你也会被波及的。到时候你地位不保是小，咱们家族也会受到牵连，你自己好好想想吧！”

  “我知道了。”

  眼前女子泪流满面的下定决心回道。

  “好！我这就去办。”

  紧接着那名医师转身离开产房。

  没有多久，一名在车祸中诞生的健康婴儿被护士送了进来，放在女子身旁。

  女子望着放置在身旁的婴儿，眼泪一滴滴落下。

  当一切尘埃落定的时候，那名医师则朝着外面普通病房走去，他来到了A302病房。

  他推开病房门，却发现里面空荡荡的，他整个人呆若木鸡，大声喊道。

  “来人！”

  “萧医师，怎么了。”

  几名护士慌乱的跑过来。

  “那个婴儿呢？”

  “被死者的家属带走了.”
——
  二十年后，Z国魔都·高墙之外。

  一间光线昏暗，空气中带着一丝陈旧味道的民房里。

  灯泡忽闪忽明，电视机内传来滋滋的嘈杂声音。此时床上一道阴暗的身影坐了起来，全身裹着被罩，缓缓扭过头来。

  只见一名头发乱糟糟，面孔十分瘦弱的青年浮现了出来。

  此时闹钟也响了起来。

  “嗡嗡~~”

  苏陌起身按掉闹钟，穿好衣服，走到厨房看了一眼，菜篮子内空荡荡的，随后他走到冰箱面前，打开冰箱，偌大的冰箱比脸都干净。

  苏陌只能无奈的叹了一口气。

  “又该工作了。”

  他洗漱一番之后，走到房间角落，捡起地上的一个破旧蛇皮麻袋，走出了房间。

  打开房门一瞬间，刺眼的阳光照射进来。

  他抬起手微微遮挡下黑色的眼眸，刺眼阳光映射在他白皙脸庞上，英俊的面孔带着病态的虚弱感，薄唇微动，嘴角带着一丝慵懒。

  苏陌来到一条陈旧的街道，这里虽然非常老旧，但却是坐落在繁华大城市之中的城中村。

  街道两侧都是很小的店面，而店面上面全部都是那种陈旧的公寓，由于年份久了，墙体外表大部分都脱落了，坑坑洼洼的。

  苏陌走到旁边一家便利店门口。

  便利店的老板是一名二百斤重的大妈，在看到苏陌后，露出灿烂的笑容，拿起一瓶橙汁递给他。

  苏陌打开盖子咕噜噜喝了起来。

  “要不要再来点面包。”

  李大妈笑容满面的问道。

  “不用，我到隔壁的包子铺吃点就行。”

  苏陌少言寡语的回道，随后晃了晃手中陈旧的蛇皮袋。

  李大妈恍然大悟，连忙回道：“你等我一下！”

  紧接着大妈匆忙走到收银台，拿起一迭数了数，然后走出去，放进苏陌的蛇皮袋里，笑呵呵的说道。

  “这是今年的租金，总共是一万两千元，您收好。”

  “哦。”

  苏陌回应一句，转身正要走。

  李大妈连忙喊住苏陌。

  “等等。”

  “什么事情。”

  “那个来年租约到期了，还能续吗？租金方面”

  李大妈有点紧张望着苏陌，要知道外面的新街，租金都是十二万一年起步的。

  “照旧。”

  苏陌无精打采的挥了挥手回道。

  “太感谢了，你慢走啊！”

  李大妈喜笑颜开，有些合不拢嘴的回道。

  苏陌神情冷淡的朝着下一家店面走去，开始挨家挨户的收。

  沿途发廊，小餐馆等老板看到苏陌，纷纷笑呵呵打招呼道。

  “包租公早上好！”

  “好。”

  苏陌简单应道。

  众人纷纷笑着将租金放进苏陌的袋子里。

  中午时分，苏陌拖着沉重的蛇皮麻袋，来到外围一家四季网咖。

  这间网咖看起来有点老旧了，但是位置非常不错，他正对面刚好对着新街一所高等大学。

  “王叔！”

  苏陌罕见的开口喊道。

  随后一名头发发白的男子走了出来，他看到苏陌赶紧上去帮忙拖麻袋。

  “小陌，你怎么不转账，还是收现金。”

  “爷爷走的时候，千叮万嘱我，一定要收现金，如果人没点事干，很容易出问题。”

  “这么说到是没错，平常也没看你出门，你这样不行啊。”

  王叔点点头赞同道。

  “出门一个人没什么好玩的。”

  “好吧，对了你来的正好，我跟你说件事情。”

  “什么事情？”

  “我可能不租了。”

  王叔对苏陌无奈叹息道。

  苏陌也是一愣，他有点不解的问道：“为什么不租，这里的租金很便宜，别人想租我都不租的。实在不行，我大不了不收你今年的租金了，怎么说你也是我爷爷最好的朋友。”

  苏陌之所以租金，收得那么便宜。是因为十二年前，他跟爷爷从高墙搬迁到这里，无依无靠，这里的街坊邻居对他们爷俩非常照顾和关心。

  后来爷爷从一个地产商，收购这片城中村所有房产和土地，统一管理。

  两年前爷爷临终前，还特别嘱咐过他，一切照旧直到他们不租搬离。

  “小陌你心意我领了，你说的这个我也知道。但是你有所不知，网咖实在是经营不下去了。现在年轻人都不爱玩这个了，都在用VR设备。尤其是最近还发布了跨时代的技术ZR和史诗第一大作·星环，谁还玩这种老旧的手操电脑，一天连个人影都没有。”

  “那你不开网咖，打算做什么？”

  “我打算回乡下养老。”

  “可是我记得你的乡下亲人，不都一直靠着你寄钱吗？你不开哪来的收入？”

  ps：已完本《希泊尼战纪》《蔚蓝星途》《请叫我馆主大人》，有兴趣的可以去看看，谢谢！

  (本章完)`

// 用于测试的正则
const re = /a/gim

const re2 =
  /想要看最新章节内容，请下载爱阅小说app，无广告免费阅读最新章节内容。网站已经不更新最新章节内容，最新章节内容已经在爱阅小说APP更新。/gim
const re3 = /想要/gim
const re4 = /^.*(?:下载)?爱阅(?:小说)?app.*?。(?:活动推广期间.*。)?/gim

suite(
  '正则性能测试',

  // add('re1', () => {
  //   data.replace(re, '')
  // }),
  // add('re2', () => {
  //   data.replace(re2, '')
  // }),
  // add('re3', () => {
  //   data.replace(re3, '')
  // }),
  add('re4', () => {
    data.replace(re4, '')
  }),

  cycle(),
  complete()
)

/*

总结：
1、.*、.*?开头的正则性能非常差，应尽量避免使用，如果一定要用，请在开头添加^，能快20倍左右。
2、超过10个字的正则匹配速度最快，小于10个字速度会变慢。（1个字与10个字大约差7倍性能）（其实本身就很快了，基本不用管）


*/
